#include <stdio.h>
#include <locale.h>
#include <wchar.h>
#include <langinfo.h>
int main(void) {
 setlocale(LC_ALL,"");
  int year1, year2, year3;
 wchar_t name1[18], name2[18], name3[18];
 int d1=0, d2=0, d3=0, f1=0, f2=0, f3=0;
 /* Введение фактических данных*/
 wprintf(L"1. Введите: год, научный руководитель, диаметр антенны(м), рабочая частота(МГц) > ");
 wscanf(L"%d %s %d %d",&year1, name1, &d1, &f1);
 wprintf(L"2. Введите: год, научный руководитель, диаметр антенны(м), рабочая частота(МГц) > ");
 wscanf(L"%d %s %d %d",&year2, name2, &d2, &f2);
 wprintf(L"3. Введите: год, научный руководитель, диаметр антенны(м), рабочая частота(МГц) > ");
 wscanf(L"%d %s %d %d",&year3, name3, &d3, &f3);
 /* Вывод таблицы */
 /* вывод заголовков */
 wprintf(L"--------------------------------------------\n");
 wprintf(L"|Проекты поиска внеземных сигналов         |\n");
 wprintf(L"|------------------------------------------|\n");
 wprintf(L"|  Год  |   Научный    | Диаметр | Рабочая |\n");
 wprintf(L"|       | руководитель | антены  | частота |\n");
 wprintf(L"|-------|--------------|---------|---------|\n");
 /* вывод строк фактических данных */
 wprintf(L"| %5d | %-12s | %7d | %7d |\n", year1, name1, d1, f1);
 wprintf(L"| %5d | %-12s | %7d | %7d |\n", year2, name2, d2, f2);
 wprintf(L"| %5d | %-12s | %7d | %7d |\n", year3, name3, d3, f3);
 /* вывод примечаний */
 wprintf(L"|------------------------------------------|\n");
 wprintf(L"| Примечание: наблюдались объекты от       |\n");
 wprintf(L"|  2 звезд до нескольких галактик          |\n");
 wprintf(L"--------------------------------------------\n");
 return 0;
}
